cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Tap Additional Packages
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "jesseduffield/lazygit"
tap "teamookla/speedtest"

# Cask
cask "1password"
cask "adobe-acrobat-reader"
cask "airfoil"
cask "alfred"
cask "app-cleaner"
cask "audio-hijack"
cask "authy"
cask "calibre"
cask "dash"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "keka"
cask "losslesscut"
cask "maccy"
cask "macdown"
cask "rectangle"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "tor-browser"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"

# Font Cask
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hack"
cask "font-victor-mono"

# System
brew "autojump"
brew "binutils"
brew "coreutils"
brew "curl"
brew "dnstracer"
brew "dockutil"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gmp"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "htop"
brew "mas"
brew "mackup"
brew "moreutils"
brew "nmap"
# brew "node" --> nvm
brew "openssh"
brew "openssl"
brew "packer-completion"
brew "packer"
brew "pidof"
brew "pstree"
brew "rename"
brew "rlwrap"
brew "rsync"
brew "screen"
brew "socat"
brew "ssh-copy-id"
brew "sslscan"
brew "tldr"
brew "trash"
brew "tree"
brew "vim"
brew "wget"
brew "yadm"

# Images, Audio, Video
brew "ffmpeg"
brew "gifify"
brew "gifsicle"
brew "imagemagick"
brew "youtube-dl"

# Archive & Git
brew "git"
brew "gh"
brew "git-extras"
brew "git-lfs"
brew "hub"
brew "jesseduffield/lazygit/lazygit"
brew "lazygit"
brew "p7zip"
brew "tig"
brew "xz"

# Extract rpm file content with rpm2cpio *.rpm | cpio -ivd
brew "rpm2cpio"

# JSON
brew "jo"
brew "jq"

# Dev
brew "awscli"
brew "bash-completion@2"
brew "cmake"
brew "composer"
brew "diff-so-fancy"
brew "go"
brew "heroku/brew/heroku"
brew "kind"
brew "openjdk"
brew "python"
brew "pip-completion"
brew "rbenv"
brew "ruby"
brew "whalebrew"
brew "yarn"
# brew "zsh-autosuggestions" --> installed with oh-my-zhs 
# brew "zsh-syntax-highlighting" --> installed with oh-my-zhs 

# App Store
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "bitwarden", id: 1352778147
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
